import './tests';

//
// /**
//  todo
//  - сравнить результаты всех unpack'ов с php-шным аналогом
//  - проверить необходимость заменить ```_.values(...)``` на ```_.valuesIn(...)```
//  - проверить необходимость заменить ```__.php.array_keys(...)``` на ```_.keys(...)``` или ```_.keysIn(...)```
//  - избавиться от интерфейсов и прописать их в jsdoc с помощью @typedef и @implements
//  - вызов методов внутренних объектов в декораторах и проксях через ```this.object.methodName.apply(this.object, arguments)```
//  - попробовать заменить длиннющие списки методов у проксей и декораторов на какой-нибудь магический вызов через ```$superp```
//  */
